const unicodeBox = document.getElementById('unicodeBox');

const symbols = ["෴","⚐","⚑","⚜","★","☆","✦","✧","✩","✪","✫","✬","✭","✮","✯","✰","✱","✲","✳","✴","✵","✶","✷","✸","✹","✺","✻","✼","✽","☀︎","☁︎","☂︎","☃︎","☄︎","☼","☽","☾","✺","✹","⚒","⚔","⚖","⚗","⚙","⚓","⛏","⛓","⚕","✈︎","⛵︎","⛴︎","⛺︎","✂︎","✉︎","✍︎","✏︎","✒︎","✎","☎︎","☏","⌂","⌘","⌥","⌫","⌦","⎋","♪","♫","♩","♬","♭","♮","♯","♔","♕","♖","♗","♘","♙","♚","♛","♜","♝","♞","♟","♠","♣","♥","♦","♤","♧","♡","♢","✝","✚","✛","✜","✠","☥","☮","☯","⚘","✿","❀","❁","☘︎","⚡︎","⚠︎","♻︎","☣","☢","✇","✆",];

let currentSymbol = 0;

function updateSymbol() {
    currentSymbol = (currentSymbol + 1) % symbols.length;
    unicodeBox.textContent = symbols[currentSymbol];
}

setInterval(updateSymbol, 2000);